import java.util.Random;

/* 5. Напишете програма, която генерира случайно рекламно съобщение за някакъв продукт. Съобщенията трябва да се състоят от хвалебствена фраза, следвани от хвалебствена случка, следвани от автор (първо и второ име) и град, които се избират от предварително подготвени списъци. Например, нека имаме следните списъци:
- Хвалебствени фрази: {"Продуктът е отличен.", "Това е страхотен продукт.", "Постоянно ползвам този продукт.", "Това е най-добрият продукт от тази категория."}.
- Хвалебствени случки: {"Вече се чувствам добре.", "Успях да се променя.", "Той направи чудо.", "Не мога да повярвам, но вече се чувствам страхотно.", "Опитайте и вие. Аз съм много доволна."}.
- Първо име на автор: {"Диана", "Петя", "Стела", "Елена", "Катя"}.
- Второ име на автор: {"Иванова", "Петрова", "Кирова"}.
- Градове: {"София", "Пловдив", "Варна", "Русе", "Бургас"}.
Тогава програма би могла да изведе следното случайно-генерирано рекламно съобщение:
Постоянно ползвам този продукт. Опитайте и вие. Аз съм доволна. -– Елена Петрова, Варна */
public class Exercise_05 {
	public static final String[] LAUDATORY_PHRASES = { "Продуктът е отличен.", "Това е страхотен продукт.",
			"Постоянно ползвам този продукт.", "Това е най-добрият продукт от тази категория." };
	public static final String[] lAUDATORY_HAPPENINGS = { "Вече се чувствам добре.", "Успях да се променя.",
			"Той направи чудо.", "Не мога да повярвам, но вече се чувствам страхотно.",
			"Опитайте и вие. Аз съм много доволна." };
	public static final String[] FIRST_NAMES = { "Диана", "Петя", "Стела", "Елена", "Катя" };
	public static final String[] SURNAMES = { "Иванова", "Петрова", "Кирова" };
	public static final String[] CITIES = { "София", "Пловдив", "Варна", "Русе", "Бургас" };
	public static Random rnd = new Random();

	public static void main(String[] args) {
		String advertisementMessage = getRandomString(LAUDATORY_PHRASES) + " " + getRandomString(lAUDATORY_HAPPENINGS)
				+ " - " + getRandomString(FIRST_NAMES) + " " + getRandomString(SURNAMES) + ", "
				+ getRandomString(CITIES);

		System.out.println(advertisementMessage);

	}

	public static String getRandomString(String[] array) {
		return array[rnd.nextInt(array.length)];
	}
}
