/* 6. Обяснете ситуациите, при които се използва try-finally конструкцията.*/
public class Exercise_06 {
/*	Всеки блок try може да съдържа блок finally. Блока finally се изпълнява винаги при излизане от try блока, 
	независимо как се излиза от try блока. Това гарантира изпълнението на finally блока дори ако възникне 
	неочаквано изключение или се излезе с израз return.
	Блокът finally няма да се изпълни, ако по време на изпълнението на блока try виртуалната машина прекрати изпълнението си!
	
	Най-често използваме finally за освобождаване на ресурси които се използват в try блока.*/
}
