/* 5. Обяснете какво представляват изключенията, кога се използват и как се прихващат.*/
public class Exercise_05 {
/*	Изключение (exception) в общия случай е уведомление за дадено събитие, нарушаващо нормалната работа на една програма. Изключенията
	дават възможност това необичайно събитие да бъде обработено и програмата да реагира по някакъв начин.
	Когато възникне изключение конкретното 
	състояние на програмата се запазва и се търси обработчик на изключението (exception handler).
	Прихващане и обработка на изключения
	
	Exception handling (инфраструктура за обработка на изключенията) е част от средата – механизъм,
	който позволява хвърлянето и прихващането на изключения. Част от тази инфраструктура са дефинираните 
	езиковите конструкции за хвърляне и прихващане на изключения. Тя се грижи и затова изключението да стигне до кода,
	който може да го обработи.

	След като един метод хвърли изключение, виртуалната машина търси код, който да го прихване и евентуално обработи.
	Всяка програма на Java започва с main() метод. В него може да се извика друг метод да го наречем "Метод 1", 
	който от своя страна извиква "Метод 2" и т.н., докато се извика "Метод N".
	Когато "Метод N" свърши работата си управлението на програмата се връща на предходния и т. н., докато се стигне до
	main() метода. След като се излезе от него свършва и програмата. Като се извиква нов метод той се добавя най-отгоре в стека,
	а като свърши изпълнението му метода се изважда от стека.
	
	За да прихванем изключение обгръщаме парчето код, където може да възникне изключение с програмната конструкция try-catch:
		try {
			Some sode that may throw and exception
			} catch (ExceptionType objectName) {
			// Code handling an Exception
			} catch (ExceptionType objectName) {
			// Code handling an Exception
			}
	Конструкцията се състои от един try блок, обгръщащ валидни Java конструкции, които могат да хвърлят изключения, 
	следван от един или много catch блока, които обработват различни по тип изключения. В catch блокът ExceptionType 
	трябва да е тип на клас, който е наследник на класа java.lang.Throwable.*/
}
